Integračný manuál eFORM/Externá zbernica (USR)/GetRelatedDocumentByType/EFORM_GETRELATEDDOCUMENTBYTYPE_SOAP_V_1_0__REQ.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://schemas.gov.sk/ServiceBus/service/1.0/IServiceBus/CallService</Action>
		<ActivityId CorrelationId="638fa533-d8b6-4773-823c-9a6e78c547f1" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">b29fbd27-ed7d-464b-8216-37ecbfef6229</ActivityId>
		<VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink"/>
	</s:Header>
	<s:Body>
		<CallService xmlns="http://schemas.gov.sk/ServiceBus/service/1.0">
			<serviceClass>EFORM_GETRELATEDDOCUMENTBYTYPE_SOAP_V_1_0</serviceClass>
			<serviceParameter xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:d4p2="http://schemas.gov.sk/ServiceBusServiceProvider/Ness/eFormProvider/1.0" i:type="d4p2:GetRelatedDocumentByTypeReq">
				<d4p2:FormTemplate>
					<d4p2:Identifier>ED.DeliveryReportAuthorization</d4p2:Identifier>
					<d4p2:Version>
						<d4p2:Major>1</d4p2:Major>
						<d4p2:Minor>3</d4p2:Minor>
					</d4p2:Version>
				</d4p2:FormTemplate>
				<d4p2:RelatedDocumentLanguage>sk</d4p2:RelatedDocumentLanguage>
				<d4p2:RelatedDocumentType>CLS_F_XML_EDOC</d4p2:RelatedDocumentType>
			</serviceParameter>
		</CallService>
	</s:Body>
</s:Envelope>
